from numpy import random, mat, eye

print(random.rand(4,4))

randMat = mat(random.rand(4,4))
print(randMat.I)

invRandMat = randMat.I
print(eye(4) - randMat * invRandMat)

# 在python shell中用法
# from numpy import *
# random.rand(4,4)
# array([[0.05737893, 0.33735276, 0.17122288, 0.66153988],
#        [0.77352716, 0.44981099, 0.43629644, 0.5392609 ],
#        [0.20577101, 0.08589428, 0.64847847, 0.66145785],
#        [0.78267777, 0.61445485, 0.12707253, 0.5963357 ]])

# randMat = mat(random.rand(4,4))
# randMat.I
# matrix([[ 21.94039975,   5.75984897,  -3.22460027, -20.99039196],
#         [-13.96722199,  -5.16995903,   2.9533802 ,  14.06110675],
#         [ 31.94150762,   9.5463122 ,  -3.59125475, -32.36481366],
#         [-13.38586447,  -2.6233177 ,   1.41405663,  13.52292629]])